// Создание - Симаков К.В. 20.06.25
#Область ПрограммныйИнтерфейс

// Функция добавления элементов управления на форму
// Параметры:
// Форма - Форма - наша форма
Процедура ДополнитьФорму(Форма) Экспорт
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо1(Форма);
		ДобавитьСогласованнуюСкидку(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо1(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо1(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо2(Форма, Форма.Элементы.Основание);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо2(Форма, Форма.Элементы.СуммаДокумента);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеКонтактноеЛицо1(Форма)
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"),
					Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Sim_КонтактноеЛицо";
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицо2(Форма, ПередЭлементом)
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,
					ПередЭлементом);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Sim_КонтактноеЛицо";
КонецПроцедуры

Процедура ДобавитьСогласованнуюСкидку(Форма)
	ГруппаСкидка = Форма.Элементы.Вставить("ГруппаСкидка", Тип("ГруппаФормы"), ,
					Форма.Элементы.Страницы);
    ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;

	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"),
					Форма.Элементы.ГруппаСкидка);
 	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Sim_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении",
		"СогласованнаяСкидкаПриИзменении"
	);
	

	КомандаПересчитать = Форма.Команды.Добавить("Пересчитать");
	КомандаПересчитать.Заголовок = "Пересчитать";
	КомандаПересчитать.Действие = "ОбработкаКомандыПересчитать";
	
	КнопкаПересчитать = Форма.Элементы.Добавить("Пересчитать", Тип("КнопкаФормы"),
					Форма.Элементы.ГруппаСкидка);
	КнопкаПересчитать.ИмяКоманды = "Пересчитать";
	
КонецПроцедуры

#КонецОбласти
